#+TITLE:Emacs Note
#+AUTHOR: zhangjun
#+STARTUP: overview inlineimages shrink toc:2
#+CATEGORY: emacs
#+LANGUAGE: cn
** python
   :LOGBOOK:
   CLOCK: [2021-03-13 Sat 18:37]--[2021-03-13 Sat 18:38] =>  0:01
   :END:

使用 pyenv 管理 python 环境和版本。如果项目位于虚拟环境中，则需要使用如下命令为
该环境安装 pyls，否则打开该项目的 python 文件后提示 pyls 启动失败：

``` bash
pip -q install ipython 'python-language-server[all]
```

为了让 python lsp 正确识别 project 的 python 版本，可以如下命令指定项目的 python 版本：

#+begin_src 
pyenv local 2.7.17
#+end_src

修改了项目的 python 版本后，需要重启 workspace 的 lsp server：

#+begin_src bash
M-x lsp-workspace-restart
#+end_src

可以在 ~*Message*~ buffer 中查看 LSP python 环境信息：

#+begin_quote
LSP :: Connected to [pyls:38780 status:starting].
LSP :: Configure pyls with environment: /Users/zhangjun/.pyenv/versions/2.7.17
LSP :: pyls:38780 initialized successfully
#+end_quote

为系统指定多个 python 版本：

#+begin_src bash
  pyenv global 3.8.13 27.17
#+end_src

不能自动补全：
+ 需要先用 ~pip~ 安装项目的依赖 ~package~ ，然后才能正确的自动补全。

** Built-in Table Editor

Any line with ‘|’ as the first non-whitespace character is considered part of a
table. Moreover, a line starting with ‘|-’ is a horizontal rule.

+ C-c | (org-table-create-or-convert-from-region) :: Convert the active region
  to table
+ C-c C-c (org-table-align) :: Re-align the table without moving point.
+ TAB (org-table-next-field) :: Re-align the table, move to the next
  field. Creates a new row if necessary.
+ S-TAB (org-table-previous-field) :: Re-align, move to previous field.
+ C-c SPC (org-table-blank-field) :: Blank the field at point.
+ RET (org-table-next-row) :: Re-align the table and move down to next
  row. Creates a new row if necessary
+ M-a (org-table-beginning-of-field)
+ M-e (org-table-end-of-field)

+ M-LEFT (org-table-move-column-left) :: Move the current column left.
+ M-RIGHT (org-table-move-column-right) :: Move the current column right.
+ M-S-LEFT (org-table-delete-column) :: =Kill= the current column.
+ M-S-RIGHT (org-table-insert-column) :: Insert a new column at point
  position. Move the recent column and all cells to the right of this column to
  the right.

+ M-UP (org-table-move-row-up) :: Move the current row up.
+ M-DOWN (org-table-move-row-down) :: Move the current row down.
+ M-S-UP (org-table-kill-row) :: =Kill= the current row or horizontal line.
+ M-S-DOWN (org-table-insert-row) :: Insert a new row above the current
  row. With a prefix argument, the line is created below the current one.

+ C-c - (org-table-insert-hline) :: Insert a horizontal line below current
  row. With a prefix argument, the line is created above the current line.
+ C-c RET (org-table-hline-and-move) :: Insert a horizontal line below current
  row, and move point into the row below that line.
+ C-c ^ (org-table-sort-lines)

+ C-c C-x M-w (org-table-copy-region) :: Copy a rectangular region from a table
  to a special clipboard.
+ C-c C-x C-w (org-table-cut-region) :: Copy a rectangular region from a table
  to a special clipboard,
+ C-c C-x C-y (org-table-paste-rectangle) :: Paste a rectangular region into a
  table.
+ M-RET (org-table-wrap-region) :: Split the current field at point position and
  move the rest to the line below.

+ C-c ` (org-table-edit-field) :: Edit the current field in a separate window.
  + 当 org-table 因为 line word wrap 被隐藏时，C-c ` 命令就非常有用。
+ M-x org-table-export

+ C-c TAB (org-table-toggle-column-width) :: 根据 column width shrink 或 expand
  当前 column。
+ C-u C-c TAB (org-table-shrink) :: Shrink all columns with a column
  width. Expand the others.
+ C-u C-u C-c TAB (org-table-expand) :: Expand all columns.
|-----------+-------------------------+------------------------+-----------------------|
| <1>       | <10>                    | <20>                   | <5>                   |
|-----------+-------------------------+------------------------+-----------------------|
| asdfa     | asdfasdfasdfasdf        | asdfasdfasdfa          | adfasdfasdf           |
| asdfa     | asdfasdfas              | asdfasdfa              | asdfasdfa             |
|-----------+-------------------------+------------------------+-----------------------|
| asdfasdfa | asfasdfasdfasdfasdfasdf | asfasdfasdfasdfsadfasd | asdfasdfasdfasdfasdfa |

you can use =a special row= where the first field contains only =/=. The further
fields can either contain ‘<’ to indicate that this column should start a group,
‘>’ to indicate the end of a column, or ‘<>’ (no space between ‘<’ and ‘>’) to
make a column a group of its own.

| N | N^2 | N^3 | N^4 | sqrt(n) | sqrt[4](N) |
|---+-----+-----+-----+---------+------------|
| / |   < |     |   > |       < |          > |
| 1 |   1 |   1 |   1 |       1 |          1 |
| 2 |   4 |   8 |  16 |  1.4142 |     1.1892 |
| 3 |   9 |  27 |  81 |  1.7321 |     1.3161 |
|---+-----+-----+-----+---------+------------|
#+TBLFM: $2=$1^2::$3=$1^3::$4=$1^4::$5=sqrt($1)::$6=sqrt(sqrt(($1)))

** Dates and Times
:PROPERTIES:
:Effort:
:END:
:LOGBOOK:
CLOCK: [2021-05-28 Fri 20:02]--[2021-05-28 Fri 20:02] =>  0:00
CLOCK: [2021-05-28 Fri 19:59]--[2021-05-28 Fri 20:02] =>  0:03
CLOCK: [2021-05-24 Mon 19:19]--[2021-05-24 Mon 19:20] =>  0:01
CLOCK: [2021-05-24 Mon 19:19]--[2021-05-24 Mon 19:19] =>  0:00
CLOCK: [2021-05-18 Tue 10:21]--[2021-05-24 Mon 19:20] => 152:59
CLOCK: [2021-05-18 Tue 10:21]--[2021-05-18 Tue 10:21] =>  0:00
CLOCK: [2021-05-18 Tue 10:21]--[2021-05-18 Tue 10:21] =>  0:00
CLOCK: [2021-05-18 Tue 10:20]--[2021-05-18 Tue 10:20] =>  0:00
CLOCK: [2021-04-18 Sun 20:15]--[2021-04-18 Sun 20:15] =>  0:00
CLOCK: [2021-04-18 Sun 20:09]--[2021-04-18 Sun 20:09] =>  0:00
CLOCK: [2021-04-18 Sun 20:09]--[2021-04-18 Sun 20:09] =>  0:00
CLOCK: [2021-04-18 Sun 20:08]--[2021-04-18 Sun 20:09] =>  0:01
:END:

日期和时间戳类型：
+ Plain timestamp; Event; Appointment ::  <2006-11-02 Thu 20:00-22:00>
+ Timestamp with repeater interval ::   <2007-05-16 Wed 12:30 +1w>
+ Diary-style expression entries ::  =<%%(diary-float t 4 2)>=
+ Time/Date range ::  <2004-08-23 Mon>--<2004-08-26 Thu>
+ Inactive timestamp :: [2006-11-01 Wed]

+ C-c . (org-time-stamp) ::  当加 C-u 时插入带时间的日期；
+ C-c ! (org-time-stamp-inactive) :: 插入不活动的时间戳；
+ C-c C-c :: Normalize timestamp, insert or fix day name if missing or wrong.
+ C-c C-o (org-open-at-point) :: Access the agenda for the date given by the
  timestamp or -range at poin
+ S-LEFT (org-timestamp-down-day) / S-RIGHT (org-timestamp-up-day) :: Change
  date at point by one day.
+ S-UP (org-timestamp-up) / S-DOWN (org-timestamp-down) :: On the beginning or
  enclosing bracket of a timestamp, change its type.

+ DEADLINE: <2004-02-29 Sun>
+ SCHEDULED: <2004-12-25 Sat>
+ C-c C-d (org-deadline)
+ C-c C-s (org-schedule)
+ C-c / d (org-check-deadlines)
+ C-c / b (org-check-before-date)
+ C-c / a (org-check-after-date)

+ C-c C-x C-i (org-clock-in) :: Start the clock on the current item
  (clock-in). This inserts the ‘CLOCK’ keyword together with a timestamp wrapped
  into a ‘LOGBOOK’ drawer.
+ C-c C-x C-o (org-clock-out)
+ C-c C-x C-x (org-clock-in-last)
+ C-c C-c or C-c C-y (org-evaluate-time-range)
+ C-c C-x C-q (org-clock-cancel)
+ C-c C-x C-j (org-clock-goto)
+ C-c C-x C-d (org-clock-display)

+ C-c C-x e (org-set-effort) :: Set the effort estimate for the current
  + 默认的时间格式是 hh:mm 或 mm，也可以指定单位如 10min；
+ C-c C-x C-e (org-clock-modify-effort-estimate) :: Modify the effort estimate
  of the item currently being clocked.

+ C-c C-x 0 (org-timer-start)
+ C-c C-x ; (org-timer-set-timer)； 设置一个倒计时计时器，数字表示分钟，不支持单
  位后缀如 10min；设置前必须先关闭上面的 effort (使用 C-c C-x C-e 命令将 effort
  设置为空) 。
+ C-c C-x . (org-timer)
+ C-c C-x - (org-timer-item) 必须位于 timer list 中才有效；
+ C-c C-x , (org-timer-pause-or-continue)
+ C-c C-x _ (org-timer-stop)

